app/controllers/sessions_controller.rb

  def create
    render_unauthorized and return unless params[:email]
    user = User.where(email: params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'me@example.com' LIMIT 1